PyCitySchools with Panda

In [13]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "./jhu-apl-data-pt-07-2020-u-c/Homework/04-Pandas/Instructions/PyCitySchools/Resources/schools_complete.csv"
student_data_to_load = "./jhu-apl-data-pt-07-2020-u-c/Homework/04-Pandas/Instructions/PyCitySchools/Resources/students_complete.csv"

# # Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# # Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [14]:
school_data_complete

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [15]:
total_students = school_data_complete['student_name'].count()
total_students

39170

In [16]:
sum_total_schools  = len(school_data_complete['school_name'].unique())
sum_total_schools

15

In [17]:
total_budget = school_data_complete['budget'].unique().sum()
total_budget

24649428

In [18]:
avg_math_score = school_data_complete['math_score'].mean()
avg_math_score

78.98537145774827

In [19]:
avg_reading_score = school_data_complete['reading_score'].mean()
avg_reading_score

81.87784018381414

In [20]:
math_pass = school_data_complete[['student_name','math_score']]
math_pass

            student_name  math_score
0           Paul Bradley          79
1           Victor Smith          61
2        Kevin Rodriguez          60
3      Dr. Richard Scott          58
4             Bonnie Ray          84
...                  ...         ...
39165       Donna Howard          90
39166          Dawn Bell          70
39167     Rebecca Tanner          84
39168       Desiree Kidd          90
39169    Carolyn Jackson          75

[39170 rows x 2 columns]

In [21]:
students_passing_math = math_pass.loc[math_pass['math_score']>=70]

In [22]:
num_students_pmath = students_passing_math.count()
num_students_pmath

student_name    29370
math_score      29370
dtype: int64

In [27]:
percentage_pass_math = (num_students_pmath/total_students)*100
percentage_pass_math

student_name    74.980853
math_score      74.980853
dtype: float64

In [29]:
read_pass = school_data_complete[['student_name','reading_score']]
read_pass

            student_name  reading_score
0           Paul Bradley             66
1           Victor Smith             94
2        Kevin Rodriguez             90
3      Dr. Richard Scott             67
4             Bonnie Ray             97
...                  ...            ...
39165       Donna Howard             99
39166          Dawn Bell             95
39167     Rebecca Tanner             73
39168       Desiree Kidd             99
39169    Carolyn Jackson             95

[39170 rows x 2 columns]